Revit 2024 API
IPerformanceAdviserRule.FinalizeCheck Method
 Invoked by performance advisor once in the end of the check.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
void FinalizeCheck(
	Document document
)
Visual Basic
Sub FinalizeCheck ( _
	document As Document _
)
Visual C++
void FinalizeCheck(
	Document^ document
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 Document for which performance problems are being checked.
See Also
IPerformanceAdviserRule Interface
Autodesk.Revit.DB Namespace